tutorials/2WayCouplingOceanWave3D/testSub/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (  5 -0.4 0 )
    ( 14.5 -0.4 0 )
    ( 14.75 -0.25 0 )
    ( 15 -0.4 0 ) 
    ( 23 -0.4 0 )    
       
    (  5  0.2 0 )
    ( 14.5  0.2 0 )
    ( 14.75  0.2 0 )    
    ( 15  0.2 0 )    
    ( 23  0.2 0 )
   


    (  5 -0.4 0.1 )
    ( 14.5 -0.4 0.1 )
    ( 14.75 -0.25 0.1 )
    ( 15 -0.4 0.1 ) 
    ( 23 -0.4 0.1 )    
       
    (  5  0.2 0.1 )
    ( 14.5  0.2 0.1 )
    ( 14.75  0.2 0.1 )    
    ( 15  0.2 0.1 )    
    ( 23  0.2 0.1 )    
                       
);

blocks          
(
    hex (10 11 1 0 15 16 6 5) ( 225 1 60) simpleGrading (1 1 1)
    hex (11 12 2 1 16 17 7 6) ( 6 1 60) simpleGrading (1 1 1)
    hex (12 13 3 2 17 18 8 7) ( 6 1 60) simpleGrading (1 1 1)
    hex (13 14 4 3 18 19 9 8) ( 141 1 60) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
    patch inlet
    (
        (10 0 5 15)
    )
    wall bottom 
    (
        (10 11 1 0)
        (11 12 2 1)
        (12 13 3 2)
        (13 14 4 3)
    )
    patch outlet
    (
        (4 14 19 9)
    )

    patch atmosphere 
    (
        (5 6 16 15)
        (6 7 17 16)
        (7 8 18 17)
        (8 9 19 18)
    )
    
    empty frontBack
    (
        (0 1 6 5)
        (1 2 7 6)
        (2 3 8 7)
        (3 4 9 8)
        
        (10 11 16 15)
        (11 12 17 16)
        (12 13 18 17)
        (13 14 19 18)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
